{
    "Name": "Tavern Chili con carne",
    "Verified": true,
    "Writer": "Donald",
    "Catagory": [
        {
            "Name": "Entrées",
            "Primary": true
        },
        {
            "Name": "Sides",
            "Primary": true
        }
    ],
    "Body": {
        "Body": "\nSo you prepped too many things and need some way to use it all up?!\n\nWell, say no more, you too can learn the ways of the Tavern.\n\nSay it with me C H I L I, now hold on, don't be like that. We used quality ingredients! Only the best restaurant quality ground chuck and onions from the most enormous bulk box we could get our hands on! We sourced the finest bulk spices scoured from all over the local restaurant supply vendors.\n\nThen yes, sometimes it would just acquire extras; too many peppers were prepped for quesadillas? Chili\n\nToo many hamburger patties pressed out? Chili\n\nToo much steak? Chili\n\nIt's the perfect receptacle of things you need to get rid of, and this is how WE did it.\n# Tavern Chili\n\n     \n- 2lbs Beef, Ground            \n- 1 Onion, yellow, medium\n- 2 Jalapenos, finely diced\n- 2 Kidney beans,15.5oz can  \n- 2 Black beans, 15.5oz can\n- 1 Tomatoes, Crushed,15.5oz can   \n- Water as needed\n\nSeasonings:\n\n     \n- 1 teaspoon Cayenne Pepper   \n- 1 teaspoon Paprika, smoked        \n- 2 Tablespoons Cumin                \n- 2 Tablespoons Ground Chili            \n- 1 teaspoon (+ a pinch here and there while cooking) Salt and Pepper    \n- 1/8th cup (or to taste) Brown Sugar            \n- ½ teaspoon Oregano\n- ½ teaspoon Garlic\n- ½ teaspoon onion powder    \n\nLet's get all set up!\n\n~snaps fingers~\n\nBAM! Nailed it, look yes, those are frozen hamburger patties; I said you can just get rid of stuff with chili, plus we're in my home kitchen; I'm not that fancy.\n\nPrep your onions; about 1/2\" diced is fine; they don't have to be small; just try and get consistent.\n\n\nPeppers, same deal; just try and get them consistent.\n\nJalapenos are up to you! If you listen to your heart yearns, the Jalapenos will tell you the spice level you crave. This will add a little bit of heat; you can adjust by taking out the seeds or adding more.\n\nSpices, we always prepped these portioned out into a container, then added them and mixed them right before we added in the tomatoes and beans; the ground chili powder is really up to you. I prefer to get a couple different kinds; here, I used a mix of the powder from the Winco bulk bin and some New Mexican ground chili from those green topped spice baggies you get from the store… I don't remember the brand. These will be a bulk of your flavors, you could even make your own, but that is outside of the scope here.\n\nAdd your onions to a pan on medium-high, salt and pepper, then sauté until translucent and starting to brown. Add in your peppers, bell, jalapeno, salt, and sauté lightly before adding your raw meat.\n\n\nWhile we are waiting for that to brown, lets go ahead and rinse our beans, I just do it in the can, but you could toss them into a colander. (At the Tavern, we used giant cans, and just to make sure they were rinsed right, we would rinse them in equally giant colanders that stretched the entire prep sink, they were orange. I miss them.)\n\nWhen your meat is browned, skim ~75% of the liquid, then add in your spices and the brown sugar, stir to mix.\n\nAdd the whole can of tomatoes, stir to combine.\n\nThen pour the beans into the pot, gently stir, so you don't break them too much until they are well mixed. Fill water to just under the top (you could use some of that liquid you skimmed if you want.)\n\nNow it is time to bring it to a simmer and leave it uncovered, then wait…. and wait… and honestly, it wouldn't hurt to wait some more. Adding more time will do nothing but good things to the flavor here. Two to three hours at a nice low simmer would be ideal! The Tavern usually only managed about an hour at slightly above a simmer, though, use of the 3 working burners was precious, and they really only worked at medium-high or higher R.I.P. While you are waiting, why not make yourself your favorite drink from the selection Kayla has posted! I am sure you deserve it.\n\nIs your chili done? Your spoon stays standing up in the center of it? Now what? Well, you should probably taste it, see if it might need something… it needs something? If you don't know what it is that it still needs, in my experience, it is salt. I will deeply miss having someone ask you to taste something because it is missing something, then seeing the look on their face when you ask if they added salt. Because you know they forgot.\n\nNOW you are done, what do you do with it now? Well, you eat it; obviously, all of it, at once, in just… the most enormous bowl you can find. Then you go crawl into a corner and regret all your decisions up until this point. You could also just heap ladles full onto a large pile of fries or tots, smother it further in cheese and olives and then proceed to eat all of it… this story still ends the same way, but potato.\n\n\n",
        "Markdown": true
    },
    "Tags": [
        {
            "Value": "Meat",
            "TagType": "Type",
            "Color": "Info"
        },
        {
            "Value": "Classic Menu",
            "TagType": "Menu",
            "Color": "Success"
        }
    ]
}